20220806135724-rdbms.org
:PROPERTIES:
:ID:       2c78a4f7-d41a-407d-bf52-45b1d67d3ffa
:mtime:    20241102180349
:ctime:    20220806135724
:END:
#+title: RDBMS
* 概要
RDBMS(Relational Database Management System)は、データベース管理システムの種類の1つ。関係性によって、データベースを表現する。データベース操作は[[id:8b69b8d4-1612-4dc5-8412-96b431fdd101][SQL]]によって抽象化されていて、異なる製品でもほぼ同じ動作を期待できる。
* Memo
* Tasks
** TODO [[https://cstack.github.io/db_tutorial/][How Does a Database Work? | Let’s Build a Simple Database]]
スクラッチからDBを作成する。
** TODO [[https://github.com/huachaohuang/awesome-dbdev][huachaohuang/awesome-dbdev: Awesome materials about database development.]]
DBMSを開発するための情報集。
** TODO [[https://www.youtube.com/watch?v=vyVGm_2iFwU&list=PLSE8ODhjZXja3hgmuwhf89qboV1kOxMx7][CMU Database Systems - 01 Course introduction & Relational Data Model (Fall 2018) - YouTube]]
:LOGBOOK:
CLOCK: [2022-10-29 Sat 23:32]--[2022-10-29 Sat 23:57] =>  0:25
CLOCK: [2022-10-29 Sat 22:22]--[2022-10-29 Sat 22:48] =>  0:26
CLOCK: [2022-10-28 Fri 00:32]--[2022-10-28 Fri 00:57] =>  0:25
:END:
データベースの仕組み動画。
** TODO SQLを実行したとき何が起こっているか                      :DontKnow:
:LOGBOOK:
CLOCK: [2022-08-06 Sat 21:50]--[2022-08-06 Sat 22:15] =>  0:25
:END:
根本的な仕組みを知らない。実装してみないと。

- [[https://cstack.github.io/db_tutorial/parts/part1.html][Part 1 - Introduction and Setting up the REPL | Let’s Build a Simple Database]]
- [[https://15dog.hatenablog.com/entry/2019/10/07/%E3%80%8CRDBMS%E8%A7%A3%E5%89%96%E5%AD%A6%E3%80%8D%E3%82%92%E8%AA%AD%E3%82%93%E3%81%A0][「RDBMS解剖学」を読んだ - lasciva blog]]

- [[id:8b69b8d4-1612-4dc5-8412-96b431fdd101][SQL]]を解釈実行する
  - SQL構文解析
  - プランナ(オプティマイザ)
  - 実行エンジン
- データベースの構造を司る
  - カタログ管理
  - インデックス管理
  - バッファ管理
  - ストレージ管理
- 複数のアプリケーションからの要求や可用性を司る
  - トランザクション管理
  - 同時実行制御
  - ログリカバリ

* Reference
** [[https://zenn.dev/micin/articles/2023-12-05-majimaccho-tbls][DBスキーマはtblsのViewpointsで整理しよう]]
Viewpointsが便利。
** [[https://note.com/dafujii/n/n6e328d29d33f][tblsを使って既存データベースからデータベース定義書をMarkdownで出力する方法｜ふじい｜note]]
tblsの使い方。
** [[https://ja.wikipedia.org/wiki/%E9%96%A2%E4%BF%82%E3%83%87%E3%83%BC%E3%82%BF%E3%83%99%E3%83%BC%E3%82%B9%E7%AE%A1%E7%90%86%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0][関係データベース管理システム - Wikipedia]]
* Archives
