20220806135724-rdbms.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-10-17 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RDBMS</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">RDBMS</h1>
<div id="outline-container-org80d9ba7" class="outline-2">
<h2 id="org80d9ba7"><a href="#org80d9ba7">概要</a></h2>
<div class="outline-text-2" id="text-org80d9ba7">
<p>
RDBMS(Relational Database Management System)は、データベース管理システムの種類の1つ。関係性によって、データベースを表現する。データベース操作は<a href="20210725100835-sql.html#ID-8b69b8d4-1612-4dc5-8412-96b431fdd101">SQL</a>によって抽象化されていて、異なる製品でもほぼ同じ動作を期待できる。
</p>
</div>
</div>
<div id="outline-container-org5664d34" class="outline-2">
<h2 id="org5664d34"><a href="#org5664d34">Memo</a></h2>
</div>
<div id="outline-container-org2fd6923" class="outline-2">
<h2 id="org2fd6923"><a href="#org2fd6923">Tasks</a></h2>
<div class="outline-text-2" id="text-org2fd6923">
</div>
<div id="outline-container-org5acef4d" class="outline-3">
<h3 id="org5acef4d"><a href="#org5acef4d"><span class="todo TODO">TODO</span> <a href="https://cstack.github.io/db_tutorial/">How Does a Database Work? | Let’s Build a Simple Database</a></a></h3>
<div class="outline-text-3" id="text-org5acef4d">
<p>
スクラッチからDBを作成する。
</p>
</div>
</div>
<div id="outline-container-org697fb25" class="outline-3">
<h3 id="org697fb25"><a href="#org697fb25"><span class="todo TODO">TODO</span> <a href="https://github.com/huachaohuang/awesome-dbdev">huachaohuang/awesome-dbdev: Awesome materials about database development.</a></a></h3>
<div class="outline-text-3" id="text-org697fb25">
<p>
DBMSを開発するための情報集。
</p>
</div>
</div>
<div id="outline-container-orgc7dd021" class="outline-3">
<h3 id="orgc7dd021"><a href="#orgc7dd021"><span class="todo TODO">TODO</span> <a href="https://www.youtube.com/watch?v=vyVGm_2iFwU&amp;list=PLSE8ODhjZXja3hgmuwhf89qboV1kOxMx7">CMU Database Systems - 01 Course introduction &amp; Relational Data Model (Fall 2018) - YouTube</a></a></h3>
<div class="outline-text-3" id="text-orgc7dd021">
<p>
データベースの仕組み動画。
</p>
</div>
</div>
<div id="outline-container-orgcc25e76" class="outline-3">
<h3 id="orgcc25e76"><a href="#orgcc25e76"><span class="todo TODO">TODO</span> SQLを実行したとき何が起こっているか&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DontKnow">DontKnow</span></span></a></h3>
<div class="outline-text-3" id="text-orgcc25e76">
<p>
根本的な仕組みを知らない。実装してみないと。
</p>

<ul class="org-ul">
<li><a href="https://cstack.github.io/db_tutorial/parts/part1.html">Part 1 - Introduction and Setting up the REPL | Let’s Build a Simple Database</a></li>
<li><a href="https://15dog.hatenablog.com/entry/2019/10/07/%E3%80%8CRDBMS%E8%A7%A3%E5%89%96%E5%AD%A6%E3%80%8D%E3%82%92%E8%AA%AD%E3%82%93%E3%81%A0">「RDBMS解剖学」を読んだ - lasciva blog</a></li>

<li><a href="20210725100835-sql.html#ID-8b69b8d4-1612-4dc5-8412-96b431fdd101">SQL</a>を解釈実行する
<ul class="org-ul">
<li>SQL構文解析</li>
<li>プランナ(オプティマイザ)</li>
<li>実行エンジン</li>
</ul></li>
<li>データベースの構造を司る
<ul class="org-ul">
<li>カタログ管理</li>
<li>インデックス管理</li>
<li>バッファ管理</li>
<li>ストレージ管理</li>
</ul></li>
<li>複数のアプリケーションからの要求や可用性を司る
<ul class="org-ul">
<li>トランザクション管理</li>
<li>同時実行制御</li>
<li>ログリカバリ</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga9b50b5" class="outline-2">
<h2 id="orga9b50b5"><a href="#orga9b50b5">Reference</a></h2>
<div class="outline-text-2" id="text-orga9b50b5">
</div>
<div id="outline-container-org30d5ab7" class="outline-3">
<h3 id="org30d5ab7"><a href="#org30d5ab7"><a href="https://zenn.dev/micin/articles/2023-12-05-majimaccho-tbls">DBスキーマはtblsのViewpointsで整理しよう</a></a></h3>
<div class="outline-text-3" id="text-org30d5ab7">
<p>
Viewpointsが便利。
</p>
</div>
</div>
<div id="outline-container-org7268078" class="outline-3">
<h3 id="org7268078"><a href="#org7268078"><a href="https://note.com/dafujii/n/n6e328d29d33f">tblsを使って既存データベースからデータベース定義書をMarkdownで出力する方法｜ふじい｜note</a></a></h3>
<div class="outline-text-3" id="text-org7268078">
<p>
tblsの使い方。
</p>
</div>
</div>
<div id="outline-container-org2b2df00" class="outline-3">
<h3 id="org2b2df00"><a href="#org2b2df00"><a href="https://ja.wikipedia.org/wiki/%E9%96%A2%E4%BF%82%E3%83%87%E3%83%BC%E3%82%BF%E3%83%99%E3%83%BC%E3%82%B9%E7%AE%A1%E7%90%86%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0">関係データベース管理システム - Wikipedia</a></a></h3>
</div>
</div>
<div id="outline-container-org1c03af7" class="outline-2">
<h2 id="org1c03af7"><a href="#org1c03af7">Archives</a></h2>
</div>


<div id="outline-container-orgdbacebe" class="outline-2">
<h2 id="orgdbacebe"><a href="#orgdbacebe">Backlinks</a></h2>
<div class="outline-text-2" id="text-orgdbacebe">
<ul class="org-ul">
<li><a href="./20210829232020-mysql.html">MySQL</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
